engineer-ae3o/stm32-hal-library/components/drivers/i2s.h
#ifndef I2S_H_
#define I2S_H_


#ifdef __cplusplus
extern "C" {
#endif


#include "stm32f411xe.h"
#include "drivers/gpio.h"
#include "drivers/dma.h"
#include "utils/err.h"

#include <stdint.h>
#include <stdbool.h>


// Typedefing to make it clearer that we are working with I2S not SPI
typedef SPI_TypeDef I2S_TypeDef;

#define I2S1 ((I2S_TypeDef*)SPI1)
#define I2S2 ((I2S_TypeDef*)SPI2)
#define I2S3 ((I2S_TypeDef*)SPI3)
#define I2S4 ((I2S_TypeDef*)SPI4)
#define I2S5 ((I2S_TypeDef*)SPI5)

typedef enum : uint8_t {
    I2S_MODE_PHILIPS         = 0b00,
    I2S_MODE_LEFT_JUSTIFIED  = 0b01,
    I2S_MODE_RIGHT_JUSTIFIED = 0b10,
} i2s_mode_t;

typedef enum : uint8_t {
    I2S_DATA_16_BITS_FRAME_16_BITS = 0b00,
    I2S_DATA_16_BITS_FRAME_32_BITS = 0b11,
    I2S_DATA_24_BITS_FRAME_32_BITS = 0b01,
    I2S_DATA_32_BITS_FRAME_32_BITS = 0b10,
} i2s_frame_t;

// Full duplex not supported
typedef enum : uint8_t {
    I2S_DIR_HALF_DUPLEX_TX = 0b10,
    I2S_DIR_HALF_DUPLEX_RX = 0b11,
} i2s_dir_t;

typedef enum : uint8_t {
    I2S_FREQ_8kHz = 0,
    I2S_FREQ_16kHz,
    I2S_FREQ_22kHz, // 22.05kHz
    I2S_FREQ_32kHz,
    I2S_FREQ_44kHz, // 44.1kHz
    I2S_FREQ_48kHz,
    I2S_FREQ_96kHz,
    I2S_FREQ_192kHz,
} i2s_freq_t;

typedef struct {
    i2s_dir_t   dir;
    i2s_mode_t  mode;
    i2s_freq_t  freq;
    i2s_frame_t frame;

    bool cpol;
    bool use_mck;

    gpio_pin_t mck_pin;
    gpio_pin_t ws_pin;
    gpio_pin_t sd_pin;
    gpio_pin_t sck_pin;

    GPIO_TypeDef* gpio_port;
} i2s_master_config_t;

// Clock setup/init
void      i2s_pll_init(void);
hal_err_t i2sx_clk_enable(I2S_TypeDef* handle, bool enable);

// General API
hal_err_t i2s_master_init(I2S_TypeDef* handle, const i2s_master_config_t* config);
hal_err_t i2s_master_deinit(I2S_TypeDef* handle);
hal_err_t i2s_master_dma_init(I2S_TypeDef* handle, dma_priority_t priority);
hal_err_t i2s_master_dma_deinit(I2S_TypeDef* handle);

// DMA backed transfers API. The user should only enable the I2S peripheral with
// i2s_master_enable(...) after confirming that these functions return HAL_OK.
// And then disable the peripheral after their callback was invoked. Also, when
// double buffering, the user should disable the I2S peripheral when they want
// to "pause" or stop the transfers, and not just when the isr is called.
hal_err_t i2s_master_transmit(I2S_TypeDef* handle, const void* buf, uint16_t size, dma_done_cb_t callback, void* arg);
hal_err_t i2s_master_receive(I2S_TypeDef* handle, void* buf, uint16_t size, dma_done_cb_t callback, void* arg);

// Double buffering API
// NOTE: These APIs are mutually exclusive with the DMA oneshot functions
// NOTE: Only data reception is supported. User should determine which
// buffer is free with i2s_master_dbm_get_filled_buffer()
hal_err_t i2s_master_dbm_init(I2S_TypeDef* handle, void* buf_0, void* buf_1, uint16_t size, dma_done_cb_t callback, void* arg);
hal_err_t i2s_master_dbm_deinit(I2S_TypeDef* handle);

// When start is called, the DMA starts filling buffer A, and
// then the isr is fired on completion, then starts filling B
// NOTE: Calling stop can cause the peripheral to drop samples
// and consequently, the peripheral to trigger an overrun error.
// So to "pause" or stop transfers, the peripheral should also be
// disabled because these functions just enable and disable the DMA
// stream being used.
hal_err_t i2s_master_dbm_start(I2S_TypeDef* handle);
hal_err_t i2s_master_dbm_stop(I2S_TypeDef* handle);

// Returns 0 (out parameter) if the first buffer is filled and the DMA controller has started filling the second buffer
// Returns 1 (out parameter) if the second buffer is filled and the DMA controller has started filling the first buffer again
hal_err_t i2s_master_dbm_get_filled_buffer(I2S_TypeDef* handle, uint8_t* buffer_idx);


#ifdef __cplusplus
}
#endif


#endif // I2S_H_